Repository: giellalt/corpus-sme
Catalog: tmx/eng/admin/sd/www.samediggi.fi/index2.php_option=com_content_task=view_id=156_lang=davvi.html.tmx
Source language: sme
Languages: eng

source: Davvisámegielat oahppamateriálat
eng: North Sámi study materials

source: Eatnigiella Girjjálašvuohta Davvisámegiella vieris giellan Badjeskuvlla matematihkka Vuolleskuvlla matematihkka Fysihkka ja kemiija Deavvašvuođadiehtu Biologiija Biras- ja luonddudiehtu Eatnandiehtu Oskkoldat ja eallinoaidnu Historjá ja servodatdiehtu Duodji Eará materiálat Ruovttudoallu
eng: Mother tongue, North Sámi

source: Girjjálašvuohta
eng: Literature, North Sámi

source: Deavvašvuođadiehtu
eng: North Sámi as foreign language

source: Biologiija
eng: Mathematic s, grades 7-9

source: Biras- ja luonddudiehtu
eng: Mathematics, grades 1-6

source: Oskkoldat ja eallinoaidnu
eng: Physics and chemistry

source: Historjá ja servodatdiehtu
eng: Nature and environment

source: Duodji
eng: Geography

source: Eará materiálat
eng: Religion and view of life

source: Ruovttudoallu
eng: History
